console.log("Hello World!!~~");
//console.log("Hello" + "world!!");
/**
 * 주석(Command)
 * - 프로그램 소스 코드에 설명을 작성해 둔 부분을 의미 
 * - 주석은 컴파일러와 인터프리터에 의해 무시되므로 
 * 따로 실행되지 않는다 
 * - 주석을 활용하면 코드에 대한 이해력을 향상시킬 수 있고
 * 타인이 코드를 봤을 때 프로그램의 작동 방식을 쉽게 
 * 이해할 수 있다 
 * 
 * JavaScript란 
 * - HTML이 웹 페이지의 구조를 정의하는 역할을 한다면 
 * css는 html로 구성된 웹 페이지의 시각적인 표현을 담당한다
 * (스타일 시트를 사용하여 색상, 레이아웃, 폰트, 간격 등이
 * 스타일을 지정하여 웹 페이지를 디자인 한다.)
 * JavaScript는 웹 페이지를 동적으로 만들기 위해 사용된다 
 * 그리고 자바스크립트는 웹 페이지에서 복잡한 기능을 
 * 구현할 수 있도록 하는 스크립팅 언어
 * (이미지 슬라이드, 클릭 이벤트, 드롭다운 메뉴, 또는
 * 객체 색상의 동적 변화 이러한 것들이 js의 효과를 보는 것 )
 */